In [5]:
#1. Create a DataFrame with the following data:  

import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [24, 27, 22, 32, 29],
    'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'],
    'Salary': [45000, 54000, 50000, 62000, 47000]
}

df = pd.DataFrame(data)
df

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

In [6]:
#a. Print the first five rows of the DataFrame. 
print(df.head())

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

In [7]:
# Summary statistics for 'Age' and 'Salary' columns
print(df[['Age', 'Salary']].describe())

             Age        Salary
count   5.000000      5.000000
mean   26.800000  51600.000000
std     3.962323   6730.527468
min    22.000000  45000.000000
25%    24.000000  47000.000000
50%    27.000000  50000.000000
75%    29.000000  54000.000000
max    32.000000  62000.000000

In [8]:
# Filter for HR department and calculate average salary
average_hr_salary = df[df['Department'] == 'HR']['Salary'].mean()
print("Average HR Salary:", average_hr_salary)

Average HR Salary: 46000.0

In [9]:
#2. Add a new column, 'Bonus', which is 10% of the salary.  


df['Bonus'] = df['Salary'] * 0.10
print(df)

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Bob   27    Finance   54000  5400.0
2  Charlie   22         IT   50000  5000.0
3    Diana   32  Marketing   62000  6200.0
4      Eve   29         HR   47000  4700.0

In [10]:
# Filter DataFrame to show employees aged between 25 and 30

filtered_age_df = df[(df['Age'] >= 25) & (df['Age'] <= 30)]

print("\nEmployees aged between 25 and 30:")
print(filtered_age_df)

Employees aged between 25 and 30:
  Name  Age Department  Salary   Bonus
1  Bob   27    Finance   54000  5400.0
4  Eve   29         HR   47000  4700.0

In [11]:
# Group data by 'Department' and calculate the average salary for each

average_salary_by_department = df.groupby('Department')['Salary'].mean()

print("\nAverage salary by Department:")
print(average_salary_by_department)

Average salary by Department:
Department
Finance      54000.0
HR           46000.0
IT           50000.0
Marketing    62000.0
Name: Salary, dtype: float64

In [14]:
# Sort the DataFrame by 'Salary' in ascending order

sorted_df = df.sort_values(by='Salary', ascending=True)

# Save the sorted DataFrame to a new CSV file
# index=False prevents pandas from writing the DataFrame index as a column in the CSV
sorted_df.to_csv('sorted_salaries.csv', index=False)

print(sorted_df)
print("\nCheck your directory for 'sorted_salaries.csv'!")

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
4      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
1      Bob   27    Finance   54000  5400.0
3    Diana   32  Marketing   62000  6200.0

Check your directory for 'sorted_salaries.csv'!

In [18]:
import pandas as pd

# Load the CSV file into a new DataFrame
loaded_df = pd.read_csv('sorted_salaries.csv')
loaded_df

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
3      Bob   27    Finance   54000  5400.0
4    Diana   32  Marketing   62000  6200.0